distinguish.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-06-27 Fri 17:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Explosives and Distinguishers</title>
<meta name="author" content="Nathan" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="myStyle.css" />
</head>
<body>
<div id="org-div-home-and-up"><a href="index.html">â†©</a></div><div id="content" class="content">
<h1 class="title">Explosives and Distinguishers</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgff7f493">Distinguishers</a></li>
<li><a href="#org0852c50">Inequality</a></li>
<li><a href="#org3d1a64d">Decidability</a></li>
</ul>
</div>
</div>
<p>
<i><b>Abstract.</b> TODO</i> Testing
</p>

<p>
This piece is contains quite a few (read: far too many) proofs in <a href="https://docs.racket-lang.org/pie/index.html">Pie</a>,
a simple, beautiful, but verbose dependently typed programming
language.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> Before getting started, a small logical interface
used throughout to make proofs more readable:
</p>

<div class="org-src-container">
<pre class="src src-lisp">#lang pie

(claim &#8869; U)
(define &#8869; Absurd)

(claim &#8868; U)
(define &#8868; Trivial)

(claim &#172; (&#8594; U U))
(define &#172; (&#955; (A) (&#8594; A &#8869;)))

(claim &#8743; (&#8594; U U U))
(define &#8743; (&#955; (A B) (Pair A B)))

(claim &#8744; (&#8594; U U U))
(define &#8744; (&#955; (A B) (Either A B)))

(claim &#8596; (&#8594; U U U))
(define &#8596; (&#955; (A B) (&#8743; (&#8594; A B) (&#8594; B A))))

(claim &#8800; (&#928; ((A U)) (&#8594; A A U)))
(define &#8800; (&#955; (A x y) (&#172; (= A x y))))
</pre>
</div>

<p>
I recently spent an inordinate amount of time thinking about Pie
formalizations of the following theorem:
</p>

<blockquote>
<p>
<i>1 = 0 implies I am the Pope.</i>
</p>
</blockquote>

<p>
I was interested primarily in proofs that could be carried out in the
minimal fragment of Pie, i.e., without the use of <a href="https://docs.racket-lang.org/pie/index.html#%28def._%28%28lib._pie%2Fmain..rkt%29._ind-.Absurd%29%29"><code>ind-Absurd</code></a>, the
induction principle for the empty type which expresses the <a href="https://en.wikipedia.org/wiki/Principle_of_explosion">principle
of explosion</a>.
</p>

<p>
Working in this vein leads one naturally to a standard fact of
constructive mathematics: 1 = 0 is <i>explosive</i> in the sense that
anything follows from it in the minimal fragment of Pie.<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>
</p>

<div class="org-src-container">
<pre class="src src-lisp">(claim explode-1=0
  (&#8594; (= Nat 1 0) (&#928; ((A U)) A)))
(define explode-1=0
  (&#955; (1=0 A)
     (replace
       1=0
       (&#955; (a) (which-Nat a A (&#955; (_) &#8868;)))
       sole)))
</pre>
</div>

<p>
This leads one <i>further</i> to another natural enough question: <i>which
equalities are explosive?</i>
</p>
<div id="outline-container-orgff7f493" class="outline-2">
<h2 id="orgff7f493">Distinguishers</h2>
<div class="outline-text-2" id="text-orgff7f493">
<p>
Its straightforward enought to generalize the above proof to any fixed
pair of natural numbers.
</p>

<div class="org-src-container">
<pre class="src src-nil">(claim sub1 (â†’ Nat Nat))
(define sub1
  (Î» (n)
     (which-Nat n 0 (Î» (n-1) n-1))))

(claim âˆ¸ (â†’ Nat Nat Nat))
(define âˆ¸
  (Î» (m n)
     (iter-Nat n m sub1)))

(claim 5=7â†’1=0
  (â†’ (= Nat 5 7) (= Nat 1 0)))
(define 5=7â†’1=0
  (Î» (5=7)
     (symm
       (cong
         5=7
         (the
           (â†’ Nat Nat)
           (Î» (n) (âˆ¸ n 6)))))))

(claim explode-5=7
  (â†’ (= Nat 5 7) (Î  ((A U)) A)))
(define explode-5=7
  (Î» (5=7)
     (explode-1=0 (5=7â†’1=0 5=7))))
</pre>
</div>

<p>
It also works for the equality true = false, given the standard sum
type encoding of Booleans.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(claim Bool U)
(define Bool (Either &#8868; &#8868;))

(claim true Bool)
(define true (left sole))

(claim false Bool)
(define false (right sole))

(claim ind-Bool
  (&#928; ((target Bool)
      (motive (&#8594; Bool U))
      (true-case (motive true))
      (false-case (motive false)))
     (motive target)))
(define ind-Bool
  (&#955; (target motive true-case false-case)
     (ind-Either
       target
       motive
       (&#955; (_) true-case)
       (&#955; (_) false-case))))

(claim bool&#8594;nat (&#8594; Bool Nat))
(define bool&#8594;nat
  (&#955; (b) (ind-Bool b (&#955; (_) Nat) 1 0)))

(claim true=false&#8594;1=0
  (&#8594; (= Bool true false) (= Nat 1 0)))
(define true=false&#8594;1=0
  (&#955; (true=false) (cong true=false bool&#8594;nat)))

(claim explode-true=false
  (&#8594; (= Bool true false) (&#928; ((A U)) A)))
(define explode-true=false
  (&#955; (true=false)
     (explode-1=0 (true=false&#8594;1=0 true=false))))
</pre>
</div>

<p>
All we're really doing here is bootstrapping; if an equality implies
that 1 = 0 then it's explosive.  This is not so natural a condition,
but it hints at a definition: let's say boolean function ğ‘“ : ğ´ â†’ Bool
<i>distinguishes</i> two values ğ‘ and ğ‘ if ğ‘“ ğ‘ is true and ğ‘“ ğ‘ is false.
Furthermore, ğ‘ and ğ‘ are <i>distinguishable</i>, written ğ‘ â—‡ ğ‘, if there
is a distinguisher for them.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(claim Distinguishes
  (&#928; ((A U)
      (f (&#8594; A Bool)))
     (&#8594; A A U)))
(define Distinguishes
  (&#955; (_ f x y)
     (&#8743; (= Bool (f x) true)
        (= Bool (f y) false))))

(claim &#9671;
  (&#928; ((A U))
     (&#8594; A A U)))
(define &#9671;
  (&#955; (A x y)
     (&#931; ((f (&#8594; A Bool)))
        (Distinguishes A f x y))))

<span style="color: #b22222;">; </span><span style="color: #b22222;">the following are getters for &#9671;</span>

(claim distinguisher-&#9671;
  (&#928; ((A U)
      (x A)
      (y A)
      (x&#9671;y (&#9671; A x y)))
     (&#8594; A Bool)))
(define distinguisher-&#9671;
  (&#955; (_ _ _ x&#9671;y)
     (car x&#9671;y)))

(claim distinguishes-fst
  (&#928; ((A U)
      (x A)
      (y A)
      (x&#9671;y (&#9671; A x y)))
     (= Bool
        (distinguisher-&#9671; A x y x&#9671;y x)
        true)))
(define distinguishes-fst
  (&#955; (_ _ _ x&#9671;y)
     (car (cdr x&#9671;y))))

(claim distinguishes-snd
  (&#928; ((A U)
      (x A)
      (y A)
      (x&#9671;y (&#9671; A x y)))
     (= Bool
        (distinguisher-&#9671; A x y x&#9671;y y)
        false)))
(define distinguishes-snd
  (&#955; (_ _ _ x&#9671;y)
     (cdr (cdr x&#9671;y))))
</pre>
</div>

<p>
Distinguishability captures more generally what's going on in the case
of 5 = 7 and true = false.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(claim &#9671;&#8594;explode&#8316;
  (&#928; ((A U)
      (x A)
      (y A))
     (&#8594; (&#9671; A x y)
        (= A x y)
        (&#928; ((B U)) B))))
(define &#9671;&#8594;explode&#8316;
  (&#955; (A x y x&#9671;y x=y)
    (explode-true=false
      (trans
        <span style="color: #b22222;">; true = f x</span>
        (symm (distinguishes-fst A x y x&#9671;y))
        (trans
          <span style="color: #b22222;">; f x = f y</span>
          (cong x=y (distinguisher-&#9671; A x y x&#9671;y))
          <span style="color: #b22222;">; f y = false</span>
          (distinguishes-snd A x y x&#9671;y))))))
</pre>
</div>

<p>
In other words, <i>any equality of distinguishable terms is explosive.</i>
</p>
</div>
</div>
