distinguish.org
* Inequality

Distinguishability is a strictly stronger relation than inquality in
the minimal fragment of Pie.[fn::Moving forward, we'll take advantage
of the fact that the principle of explosion is not a theorem in the
minimal fragment of Pie: to show that any other claim is not a
theorem, it suffices to show that it implies explosion.]

#+begin_src lisp
  (claim â—‡â†’â‰ 
    (Î  ((A U)
        (x A)
        (y A))
       (â†’ (â—‡ A x y)
          (â‰  A x y))))
  (define â—‡â†’â‰ 
    (Î» (A x y xâ—‡y x=y)
       (â—‡â†’explodeâ¼ A x y xâ—‡y x=y âŠ¥)))

  (claim âŸ¨â‰ â†’â—‡âŸ©â†’ind-âŠ¥
    (â†’ (Î  ((A U)
           (x A)
           (y A))
          (â†’ (â‰  A x y)
             (â—‡ A x y)))
       (â†’ âŠ¥ Î  ((A U)) A))))
  (define âŸ¨â‰ â†’â—‡âŸ©â†’ind-âŠ¥
    (Î» (â‰ â†’â—‡ absurd)
       (â—‡â†’explodeâ¼
         âŠ¤
         sole
         sole
         (â‰ â†’â—‡
           âŠ¤
  	 sole
  	 sole
  	 (Î» (_) absurd))
         (same sole))))
#+end_src

We also can't prove â‰ â†’â—‡ full Pie but this isn't something that can be
witnessed within Pie itself, as it's a theorem in the classical
extension of Pie (more on this later). The principle â‰ â†’â—‡ has the
flavor of many well-studied semi-classical principles: it expresses
the ability to extract something constructive from a negation
proof.[fn::See TODO]

And we are led quite naturally to the real motivating question of this
piece: /For what types are unequal values distinguishable?/ And how
does the answer change depending on our system?

What I aim to demonstrate is that in all cases (minimal, constructive,
paraconsistent, classical) the following holds:

#+begin_quote
/If A admits decidable equality, then unqual values of type A are
distinguishable./
#+end_quote

What is most interesting is that the statement is sensitive to exactly
how decidable equality is defined.

