distinguish.html
<div id="outline-container-org0852c50" class="outline-2">
<h2 id="org0852c50">Inequality</h2>
<div class="outline-text-2" id="text-org0852c50">
<p>
Distinguishability is a strictly stronger relation than inquality in
the minimal fragment of Pie.<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>
</p>

<div class="org-src-container">
<pre class="src src-lisp">(claim &#9671;&#8594;&#8800;
  (&#928; ((A U)
      (x A)
      (y A))
     (&#8594; (&#9671; A x y)
        (&#8800; A x y))))
(define &#9671;&#8594;&#8800;
  (&#955; (A x y x&#9671;y x=y)
     (&#9671;&#8594;explode&#8316; A x y x&#9671;y x=y &#8869;)))

(claim &#10216;&#8800;&#8594;&#9671;&#10217;&#8594;ind-&#8869;
  (&#8594; (&#928; ((A U)
         (x A)
         (y A))
        (&#8594; (&#8800; A x y)
           (&#9671; A x y)))
     (&#8594; &#8869; &#928; ((A U)) A))))
(define &#10216;&#8800;&#8594;&#9671;&#10217;&#8594;ind-&#8869;
  (&#955; (&#8800;&#8594;&#9671; absurd)
     (&#9671;&#8594;explode&#8316;
       &#8868;
       sole
       sole
       (&#8800;&#8594;&#9671;
         &#8868;
         sole
         sole
         (&#955; (_) absurd))
       (same sole))))
</pre>
</div>

<p>
We also can't prove â‰ â†’â—‡ full Pie but this isn't something that can be
witnessed within Pie itself, as it's a theorem in the classical
extension of Pie (more on this later). The principle â‰ â†’â—‡ has the
flavor of many well-studied semi-classical principles: it expresses
the ability to extract something constructive from a negation
proof.<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>
</p>

<p>
And we are led quite naturally to the real motivating question of this
piece: <i>For what types are unequal values distinguishable?</i> And how
does the answer change depending on our system?
</p>

<p>
What I aim to demonstrate is that in all cases (minimal, constructive,
paraconsistent, classical) the following holds:
</p>

<blockquote>
<p>
<i>If A admits decidable equality, then unqual values of type A are
distinguishable.</i>
</p>
</blockquote>

<p>
What is most interesting is that the statement is sensitive to exactly
how decidable equality is defined.
</p>
</div>
</div>
