distinguish.html
<div id="outline-container-org3d1a64d" class="outline-2">
<h2 id="org3d1a64d">Decidability</h2>
<div class="outline-text-2" id="text-org3d1a64d">
<p>
A type ğ´ admits decidable equality if for any two values ğ‘â‚ and ğ‘â‚‚ of
type ğ´, we have ğ‘â‚ = ğ‘â‚‚ or ğ‘â‚ â‰  ğ‘â‚‚.  This can be seen as a restriction
of the law of excluded middle.  But the notion of decidability
originates in computability theory, where a predicate ğ‘ƒ is decidable
if there is a computable function ğ‘“ such that ğ‘“(ğ‘¥) = 1 if and only if
ğ‘ƒ(x) holds.  Through the Curry-Howard lens, these two concepts
correspond; a term ğ‘“ of type
</p>

<blockquote>
<p>
<code>(Î  ((x A) (y A)) (âˆ¨ (= ğ´ ğ‘â‚ ğ‘â‚‚) (â‰  ğ´ ğ‘â‚ ğ‘â‚)))</code>
</p>
</blockquote>

<p>
is a computation where <code>(f x y)</code> evaluates to <code>(left _)</code> if x = y and
<code>(right _)</code> otherwise.  We begin by formalizing this, but with a
twist: we'll work in the minimal fragment of Pie in order to
demonstrate that <i>this correspondence depends on the principle of
explosion</i>.
</p>

<p>
A type ğ´ (viewed through Curry-Howard lense) is <b>decidable</b> if either
ğ´ or Â¬ğ´ holds.  The law of excluded middle is equivalent to every type
being decidable.  We can use this baseline notion of decidability to
define decidability of predicates, up to decidable equality.  Note
that if we want to use binary predicates in their Curried form, we
need to uncurry them to express their decidability.
</p>

<div class="org-src-container">
<pre class="src src-nil">(claim Decá´¾
  (Î  ((A U)
      (P (â†’ A U)))
     U))
(define Decá´¾
  (Î» (A P)
     (Î  ((x A)) (Dec (P x)))))

(claim Uncurryá´¾
  (Î  ((A U)
      (B U)
      (P (â†’ A B U)))
     (â†’ (Pair A B) U)))
(define Uncurryá´¾
  (Î» (_ _ P p)
     (P (car p) (cdr p))))

(claim Decá´¾Â²
  (Î  ((A U)
      (B U)
      (P (â†’ A B U)))
     U))
(define Decá´¾Â²
  (Î» (A B P)
     (Decá´¾ (Pair A B) (Uncurryá´¾ A B P))))

(claim Decâ¼ (â†’ U U))
(define Decâ¼
  (Î» (A)
     (Decá´¾Â²
       A
       A
       (Î» (x y) (= A x y)))))
</pre>
</div>

<p>
The computability theoretic form of decidability can be expressed as
having a decider, i.e., the existence of a function which witnesses
the truth value of the predicate (we'll use <code>true</code> and <code>false</code> instead
of <code>1</code> and <code>0</code>).
</p>

<div class="org-src-container">
<pre class="src src-nil">(claim Decides
  (Î  ((A U)
      (f (â†’ A Bool))
      (P (â†’ A U)))
     U))
(define Decides
  (Î» (A f P)
     (Î  ((x A))
        (â†” (P x)
           (= Bool (f x) true)))))

(claim Decider
  (Î  ((A U)
      (P (â†’ A U)))
     U))
(define Decider
  (Î» (A P)
     (Î£ ((f (â†’ A Bool)))
        (Decides A f P))))

(claim uncurry
  (Î  ((A U)
      (B U)
      (C U))
     (â†’ (â†’ A B C)
        (â†’ (Pair A B) C))))
(define uncurry
  (Î» (_ _ _ f p)
     (f (car p) (cdr p))))

(claim Decidesâ‚‚
  (Î  ((A U)
      (B U)
      (f (â†’ A B Bool))
      (P (â†’ A B U)))
     U))
(define Decidesâ‚‚
  (Î» (A B f P)
     (Decides
       (Pair A B)
       (uncurry A B Bool f)
       (Uncurryá´¾ A B P))))

(claim Deciderâ‚‚
  (Î  ((A U)
      (B U)
      (P (â†’ A B U)))
     U))
(define Deciderâ‚‚
  (Î» (A B P)
     (Î£ ((f (â†’ A B Bool)))
        (Decidesâ‚‚ A B f P))))

(claim Decidesâ¼
  (Î  ((A U)
      (f (â†’ A A Bool)))
     U))
(define Decidesâ¼
  (Î» (A f)
     (Decidesâ‚‚
       A
       A
       f
       (Î» (x y) (= A x y)))))

(claim Deciderâ¼ (â†’ U U))
(define Deciderâ¼
  (Î» (A)
     (Î£ ((f (â†’ A A Bool)))
        (Decidesâ¼ A f))))
</pre>
</div>

<p>
The easy direction: if a predicate ğ‘ƒ has a decider, then it is
decidable.  The proof: given ğ‘¥, ask the decider if ğ‘ƒ(ğ‘¥) or Â¬ğ‘ƒ(ğ‘¥).  We
break the proof up into two parts because working with Î£-types in Pie
is <i>not</i> ergonomic.
</p>

<div class="org-src-container">
<pre class="src src-nil">(claim decidesâ†’decá´¾-helper
  (Î  ((A U)
      (f (â†’ A Bool))
      (P (â†’ A U))
      (x A))
     (â†’ (â†” (P x) (= Bool (f x) true))
        (Dec (P x)))))
(define decidesâ†’decá´¾-helper
  (Î» (_ f P x)
     (ind-Bool
       (f x)
       (Î» (b)
          (â†’ (â†” (P x) (= Bool b true))
             (Dec (P x))))
       (Î» (prf)
          (left ((cdr prf) (same true))))
       (Î» (prf)
          (right
            (Î» (px)
               (trueâ‰ false
                 (symm ((car prf) px)))))))))

(claim deciderâ†’decá´¾
  (Î  ((A U)
      (P (â†’ A U)))
     (â†’ (Decider A P)
        (Decá´¾ A P))))
(define deciderâ†’decá´¾
  (Î» (A P decider x)
     (decidesâ†’decá´¾-helper
       A
       (car decider)
       P
       x
       ((cdr decider) x))))
</pre>
</div>

<p>
The hard direction (or, rather, the impossible direction in the
minimal setting): if ğ‘ƒ is decidable then it has a decider.  Now, we
can't <i>exactly</i> show that this does not hold in minimal Pie; proving
things don't exist in a constructive setting is tricky.  But what
we're really after is the following: if ğ‘ƒ is decidable, then the
<i>obvious</i> decider for ğ‘ƒ is, in fact, a decider.
</p>

<p>
The obvious decider is the one which is encoded in the proof of
decidability. We can define the decider generally over decidable
predicates (given a proof of decidability).
</p>

<div class="org-src-container">
<pre class="src src-nil">(claim left?
  (Î  ((A U)
      (B U))
     (â†’ (Either A B)
        Bool)))
(define left?
  (Î» (_ _ e)
     (ind-Either
       e
       (Î» (_) Bool)
       (Î» (_) true)
       (Î» (_) false))))

(claim ?
  (Î  ((A U)
      (P (â†’ A U)))
     (â†’ (Decá´¾ A P) A Bool)))
(define ?
  (Î» (_ P decá´¾ x)
     (left?
       (P x)
       (Â¬ (P x))
       (decá´¾ x))))

(claim ?â‚‚
  (Î  ((A U)
      (B U)
      (P (â†’ A B U))
      (decá´¾Â² (Decá´¾Â² A B P)))
     (â†’ A B Bool)))
(define ?â‚‚
  (Î» (A B P decá´¾Â² x y)
     (?
       (Pair A B)
       (Uncurryá´¾ A B P)
       decá´¾Â²
       (cons x y))))

(claim â‰Ÿ
  (Î  ((A U))
     (â†’ (Decâ¼ A) A A Bool)))
(define â‰Ÿ
  (Î» (A) (?â‚‚ A A (Î» (x y) (= A x y)))))
</pre>
</div>

<p>
Within the minimal fragment of Pie, if we know the value of this
decider on ğ‘, then we can derive proofs of the ğ‘ƒ(ğ‘) or Â¬ğ‘ƒ(ğ‘),
depending on that value.
</p>

<div class="org-src-container">
<pre class="src src-nil">(claim p?=trueâ†’p
  (Î  ((A U)
      (P (â†’ A U))
      (decá´¾ (Decá´¾ A P))
      (x A))
     (â†’ (= Bool (? A P decá´¾ x) true)
        (P x))))
(define p?=trueâ†’p
  (Î» (_ P decá´¾ x)
     (ind-Either
       (decá´¾ x)
       (Î» (e)
          (â†’ (= Bool
                (left? (P x) (Â¬ (P x)) e)
                true)
             (P x)))
       (Î» (px _) px)
       (Î» (_ false=true)
          (explode-true=false
            (symm false=true)
            (P x))))))

(claim p?=falseâ†’Â¬p
  (Î  ((A U)
      (P (â†’ A U))
      (decá´¾ (Decá´¾ A P))
      (x A))
     (â†’ (= Bool
           (? A P decá´¾ x)
           false)
        (Â¬ (P x)))))
(define p?=falseâ†’Â¬p
  (Î» (_ P decá´¾ x)
     (ind-Either
       (decá´¾ x)
       (Î» (e)
          (â†’ (= Bool
                (left? (P x) (Â¬ (P x)) e)
                false)
             (Â¬ (P x))))
       (Î» (_ true=false)
          (explode-true=false
            true=false
            (Â¬ (P x))))
       (Î» (Â¬px _) Â¬px))))
</pre>
</div>

<p>
What we <i>can't</i> do within minimal Pie is determine the value of the
decider itself given ğ‘ƒ(ğ‘) or Â¬ğ‘ƒ(ğ‘).  For example, ğ‘ƒ(ğ‘) implies the
equality (? ğ‘ƒ ğ‘) = true given the principle of explosion, but this
implication also <i>implies</i> the principle of explosion.  This
ultimately comes down to the fact that there isn't much we can do in
the Â¬ğ‘ƒ(ğ‘) branch of the decidability of ğ‘ƒ except explode it with our
assumption ğ‘ƒ(ğ‘).
</p>

<div class="org-src-container">
<pre class="src src-lisp">(claim ind-&#8869;&#8594;p&#8594;p?=true
  (&#8594; (&#8594; &#8869; (&#928; ((A U)) A))
     (&#928; ((A U)
         (P (&#8594; A U))
         (dec&#7486; (Dec&#7486; A P))
         (x A))
        (&#8594; (P x)
           (= Bool
              (? A P dec&#7486; x)
              true)))))
(define ind-&#8869;&#8594;p&#8594;p?=true
  (&#955; (ind-&#8869; _ P dec&#7486; x px)
     (ind-Either
       (dec&#7486; x)
       (&#955; (e)
          (= Bool
             (left? (P x) (&#172; (P x)) e)
             true))
       (&#955; (_) (same true))
       (&#955; (&#172;px)
          (ind-&#8869;&#8594;explode
            ind-&#8869;
            (P x)
            &#172;px
            px
            (= Bool false true))))))

(claim &#10216;p&#8594;p?=true&#10217;&#8594;ind-&#8869;
  (&#8594; (&#928; ((A U)
         (P (&#8594; A U))
         (dec&#7486; (Dec&#7486; A P))
         (x A))
        (&#8594; (P x)
           (= Bool
              (? A P dec&#7486; x)
              true)))
     (&#8594; &#8869; (&#928; ((A U)) A))))
(define &#10216;p&#8594;p?=true&#10217;&#8594;ind-&#8869;
  (&#955; (p&#8594;p?=true absurd)
     (explode-true=false
       (symm
         (p&#8594;p?=true
           &#8868;
           (&#955; (_) &#8868;)
           (&#955; (_) (right (&#955; (_) absurd)))
           sole
           sole)))))

(claim ind-&#8869;&#8594;&#172;p&#8594;p?=false
  (&#8594; (&#8594; &#8869; (&#928; ((A U)) A))
     (&#928; ((A U)
         (P (&#8594; A U))
         (dec&#7486; (Dec&#7486; A P))
         (x A))
        (&#8594; (&#172; (P x))
           (= Bool
              (? A P dec&#7486; x)
              false)))))
(define ind-&#8869;&#8594;&#172;p&#8594;p?=false
  (&#955; (ind-&#8869; _ P dec&#7486; x &#172;px)
     (ind-Either
       (dec&#7486; x)
       (&#955; (e)
          (= Bool
             (left? (P x) (&#172; (P x)) e)
             false))
       (&#955; (px)
          (ind-&#8869;&#8594;explode
            ind-&#8869;
            (P x)
            &#172;px
            px
            (= Bool true false)))
       (&#955; (_) (same false)))))

(claim &#10216;&#172;p&#8594;p?=false&#10217;&#8594;ind-&#8869;
  (&#8594; (&#928; ((A U)
         (P (&#8594; A U))
         (dec&#7486; (Dec&#7486; A P))
         (x A))
        (&#8594; (&#172; (P x))
           (= Bool
              (? A P dec&#7486; x)
              false)))
     (&#8594; &#8869; (&#928; ((A U)) A))))
(define &#10216;&#172;p&#8594;p?=false&#10217;&#8594;ind-&#8869;
  (&#955; (&#172;p&#8594;p?=false absurd)
     (explode-true=false
       (&#172;p&#8594;p?=false
         &#8868;
         (&#955; (_) &#8869;)
         <span style="color: #b22222;">; artificial proof of negation</span>
         (&#955; (_) (left absurd))
         sole
         (&#955; (absurd) absurd)))))
</pre>
</div>

<p>
Another theme that comes up here: in almost all cases, the <code>Trivial</code>
type is sufficient to find a counterexample in minimal Pie of a given
principle.  Most come down to an artificial proof of a negation using
our <code>Absurd</code> assumption in the principle of explosion (see the last
example above).
</p>

<p>
All of this amounts to the fact that having a decider is a strictly
stronger notion of decidability within minimal Pie (in the sense that
we cannot prove that the obvious decider is a decider).
</p>

<div class="org-src-container">
<pre class="src src-nil">(claim ind-âŠ¥â†’decá´¾â†’decides
  (â†’ (â†’ âŠ¥ (Î  ((A U)) A))
     (Î  ((A U)
         (P (â†’ A U))
         (decá´¾ (Decá´¾ A P)))
        (Decides A (? A P decá´¾) P))))
(define ind-âŠ¥â†’decá´¾â†’decides
  (Î» (ind-absurd A P decá´¾ x)
     (cons
       (ind-âŠ¥â†’pâ†’p?=true
         ind-absurd
         A
         P
         decá´¾
         x)
       (p?=trueâ†’p
         A
         P
         decá´¾
         x))))

(claim âŸ¨decá´¾â†’decidesâŸ©â†’ind-âŠ¥
  (â†’ (Î  ((A U)
         (P (â†’ A U))
         (decá´¾ (Decá´¾ A P)))
        (Decides A (? A P decá´¾) P))
     (â†’ âŠ¥ (Î  ((A U)) A))))
(define âŸ¨decá´¾â†’decidesâŸ©â†’ind-âŠ¥
  (Î» (decá´¾â†’decides absurd)
     (explode-true=false
       (symm
         ((car
            ((decá´¾â†’decides
               âŠ¤
               (Î» (_) âŠ¤)
               (Î» (_) (right (Î» (_) absurd))))
              sole))
            sole)))))
</pre>
</div>

<p>
But even though having a decider is stronger, it's not sufficient to
prove distinguishability from inequality in minimal Pie.
</p>

<p>
By virtue of having defined everything in terms of general
decidability, we get immediately as a corollary our first result, that
decidable equality implies distinguishable unequals in classical Pie.
Note again that the antecedent here is vacuous because it a special
case of the law of excluded middle.  The distinguisher is the partial
application of the obvious decider.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">TODO</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">See
Proposition 3.2 of Constructivism in Mathematics by Trolestra and van
Dalen.</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">Moving forward, we'll take advantage
of the fact that the principle of explosion is not a theorem in the
minimal fragment of Pie: to show that any other claim is not a
theorem, it suffices to show that it implies explosion.</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">See TODO</p></div></div>


</div>
</div></div>
</body>
</html>
